БухЭксп/InformationRegisters/CW_ТаблицаРегистрацииИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ТаблицаРегистрацииИзменений</Name>
			<Comment>Таблица регистрации изменений к выгрузке</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РежимыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыВыгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПризнакСозданияОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СистемныеСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Обмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метаданное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыВыгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ТаблицаРегистрацииИзменений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ИзменитьСтатусЗаписей(МассивЗаписей,НовыйСтатус) Экспорт 
	// --- 
	
	МенеджерЗаписи = РегистрыСведений.CW_ТаблицаРегистрацииИзменений.СоздатьМенеджерЗаписи();
	// --- 
	СтатусРегистрации = Перечисления.CW_СтатусыВыгрузки.Зарегистрирован;
	// --- 
	Для каждого Элемент Из МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Элемент);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Статус = НовыйСтатус;
		Если (НовыйСтатус=СтатусРегистрации) Тогда
			МенеджерЗаписи.ОшибкаВыгрузки = Ложь;
		КонецЕсли; 
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	
	// --- 
КонецПроцедуры

#КонецЕсли
